Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: 10.2.3.2.2 Verification by comparison to a reference design If a part made from an identical material, having the same or greater thickness than the reference part that has already satisfied the requirements of 8.1.3.2.3, then the test need not be performed.
et: 10.2.3.2.2 Kontroll võrdlemise teel etalonkonstruktsiooniga Kui osa on valmistatud identsest materjalist ja on sama paks või paksem kui etalonosa, mis on juba rahuldanud jaotise 8.1.3.2.3 nõudeid, ei ole katsetust vaja sooritada.

source: It is the same for all parts which have been previously tested according to their own specifications.
et: Sama kehtib kõigi osade kohta, mida on varem katsetatud nende endi spetsifikatsioonide kohaselt.

source: 10.2.3.2.3 Verification by assessment As an alternative, the original manufacturer shall provide data on the suitability of materials from the insulating material manufacturer to demonstrate compliance with IEC 60695-2-12 for the materials used and applicable temperature according to 10.2.3.2.1.
et: 10.2.3.2.3 Kontroll hindamise teel Alternatiivina peab esmatootja hankima isoleermaterjali tootjalt andmed materjali sobivuse kohta, et näidata kasutatavate materjalide vastavust standardile IEC 60695-2-12 ja rakendatava temperatuuri vastavust jaotisele 10.2.3.2.1.

source: 10.2.4 Resistance to ultraviolet (UV) radiation
et: 10.2.4 Vastupidavus ultraviolettkiirgusele

source: 10.2.4.1 Verification by test
et: 10.2.4.1 Kontroll katsetuse teel

source: This test applies only to enclosures and external parts of assemblies intended to be installed outdoors and which are constructed of insulating materials or enclosures that are entirely coated by synthetic material.
et: Seda katsetust rakendatakse üksnes välja paigaldamiseks ette nähtud koostete ümbriste ja välisosade kohta, mis on valmistatud isoleermaterjalist või mille ümbrised on täielikult kaetud sünteetilise materjaliga.

source: Representative samples of such parts shall be subjected to the following test.
et: Nende osade esinduslike näidistega tuleb sooritada allpool kirjeldatud katsetus.

source: 10.2.4.1.1 Verification for enclosures and external parts of assemblies constructed of insulating materials
et: 10.2.4.1.1 Koostete isoleermaterjalist valmistatud ümbriste ja välisosade kontroll

source: Test samples:
et: Katsetusnäidistena

source: – six test specimens of standard size according to ISO 178:2010; and – six test specimens of standard size according to ISO 179-1:2010, ISO 179-2:1997 and ISO 179-2:1997/AMD:2011,
et: — kuus standardsuurusega, standardile ISO 178:2010 vastavat katsetusnäidist ning — kuus standardsuurusega, standarditele ISO 179-1:2010, ISO 179-2:1997 ja ISO 179-2:1997/AMD:2011 vastavat katsetusnäidist.

source: The test specimens shall be made under the same conditions as those used for the manufacture of the enclosure being considered.
et: Katsetusnäidised peavad olema valmistatud samades oludes nagu need, mida on kasutatud vaadeldava ümbrise tootmisel.

source: Test sequence:
et: Katsetuse järjekord:

source: a) UV test on all twelve samples according to ISO 4892-2:2013, Method A, Cycle 1 providing a total test period of 500 h.
et: a) kõigi kaheteistkümne näidise ultraviolettkatsetus standardi ISO 4892-2:2013 meetodi A tsükli 1 järgi, nähes ette katsetuse kogukestuse 500 h;

source: b) Verification of the flexural strength in accordance with ISO 178 (method A) with six of the samples.
et: b) kuue näidise paindetugevuse kontroll standardi ISO 178 meetodi A järgi.

source: The surface of the sample exposed to UV radiation shall be turned face down and the pressure applied to the non-exposed surface.
et: Näidise ultraviolettkiirgusele allunud pind tuleb pöörata allapoole ja rakendada survejõud kiiritamata pinnale;

source: c) Verification of the Charpy impact in accordance with ISO 179 on the other six samples.
et: c) ülejäänud kuue näidise kontroll Charpy löökpaindetugevusele standardi ISO 179 järgi.

source: No notches shall be cut into the sample and the impact shall be applied to the exposed surface.
et: Näidisele ei tohi lõigata ühtegi sälku ja löök tuleb rakendada kiiritatud pinnale.

source: Results to be obtained: i) Samples shall not show cracks or deterioration visible to normal or corrected vision without additional magnification.
et: Nõutavad tulemused: i) Näidistel ei tohi olla normaalse või korrigeeritud nägemise korral suurenduseta nähtavaid mõrasid ega kahjustusi.

source: ii) The flexural strength according to ISO 178 shall have 70 % minimum retention.
et: ii) Paindetugevus standardi ISO 178 järgi peab olema vähemalt 70 % ulatuses säilinud.

source: iii) The Charpy impact according to ISO 179 shall have 70 % minimum retention.
et: iii) Charpy löökpaindetugevus standardi ISO 179 järgi peab olema vähemalt 70 % ulatuses säilinud.

source: For materials whose impact bending strength cannot be determined prior to exposure because no rupture has occurred, not more than three of the exposed test specimens shall be allowed to break.
et: Materjalide puhul, mille löökpaindetugevust ei saa määrata enne kiiritust, kuna rebendeid pole tekkinud, võib lubada puruneda mitte enam kui kolmel kiiritatud katsetusnäidisel.

source: 10.2.4.1.2 Verification for enclosures and external parts of assemblies coated on their exposed surface(s) by synthetic material Test sample: Three representative samples of suitable size shall be tested.
et: 10.2.4.1.2 Koostete ümbriste ja välisosade kontroll, kui nende kiiritatud pind (või pinnad) on kaetud sünteetilise materjaliga Katsetusnäidistena tuleb katsetada kolme esinduslikku sobiva suurusega näidist.

source: Test sequence: a) UV test on all three samples according to ISO 4892-2:2013, Method A, Cycle 1 providing a total test period of 500 h.
et: Katsetuse järjekord: a) kõigi kolme näidise ultraviolettkatsetus standardi ISO 4892-2:2013 meetodi A tsükli 1 järgi, nähes ette katsetuse kogukestuse 500 h;

source: b) Verification of the retention of the coating according to ISO 2409.
et: b) katte säilivuse kontroll standardi ISO 2409 järgi.

source: Results to be obtained: The adherence of the synthetic material shall have a minimum retention of category 3 according to ISO 2409.
et: Nõutavad tulemused: sünteetilise materjali kleepuvus peab säilima vähemalt standardi ISO 2409 kategooria 3 kohaselt.

source: 10.2.4.2 Verification by comparison to a reference design Enclosures and external parts made of the same insulating materials, irrespective of their shape and size, are covered by the test on the representative samples.
et: 10.2.4.2 Kontroll võrdlemise teel etalonkonstruktsiooniga Ümbrised ja välisosad, mis on valmistatud samadest isoleermaterjalidest, olenemata nende kujust ja suurusest, on kaetud esinduslike näidiste katsetusega.

source: 10.2.4.3 Verification by assessment As an alternative, the original manufacturer shall provide data on the suitability of materials of the same type and thickness or thinner from the insulating material supplier to demonstrate compliance with the requirements of 8.1.4.
et: 10.2.4.3 Kontroll hindamise teel Alternatiivina peab esmatootja hankima isoleermaterjali tarnijalt andmed sama liiki ja sama paksusega või õhema materjali sobivuse kohta, et näidata kasutatavate materjalide vastavust jaotise 8.1.4 nõuetele.

source: 10.2.5 Lifting
et: 10.2.5 Tõstmine

source: 10.2.5.1 Verification by test
et: 10.2.5.1 Kontroll katsetuse teel

source: If the original manufacturer makes provision for lifting other than by manual means, compliance is verified with the following tests.
et: Kui esmatootja näeb ette tõstmise muul viisil kui käsitsi, tuleb nõuetele vastavust kontrollida allpool kirjeldatud katsetustega.

source: The maximum number of sections allowed by the original manufacturer to be lifted together shall be equipped with components and/or weights to achieve a weight of 1,25 times its maximum shipping weight.
et: Esmatootja poolt korraga tõstmiseks lubatavate sektsioonide suurimale arvule tuleb lisada komponente ja/või raskusi, et saavutada 1,25-kordne suurim transpordimass.

source: With doors closed, it shall be lifted with the specified lifting means and, in the manner, defined by the original manufacturer.
et: Suletud ustega koostet tuleb tõsta esmatootja sätestatud tõstevahenditega ja määratud viisil.

source: From a standstill position, the transport unit shall be raised smoothly without jerking in a vertical plane to a height ≥ 1 m and lowered in the same manner to a standstill position.
et: Paigalseisuasendis olevat transportühikut tuleb tõsta sujuvalt ilma püstsuunaliste tõugeteta kõrgusele vähemalt 1 m ja langetada samal viisil tagasi paigalseisuasendisse.

source: This test is repeated a further two times after which the transport unit is raised up and suspended clear of the floor for 30 min without any movement.
et: Seda katsetust tuleb seejärel korrata veel kaks korda, mille järel transportühik tõstetakse üles ja riputatakse põranda kohale liikumatult 30 minutiks.

source: Following the above test and using the same transport unit, the transport unit shall be raised smoothly without jerking from a standstill position to a height ≥ 1 m and moved (10 ± 0,5) m horizontally, then lowered to a standstill position.
et: Selle katsetuse järel ja kasutades sama transportühikut, tuleb transportühikut sujuvalt tõugeteta tõsta paigalseisuasendist kõrgusele vähemalt 1 m ja liigutada horisontaalselt (10 ± 0,5) m võrra ning seejärel langetada tagasi paigalseisuasendisse.

source: This sequence shall be carried out three times at uniform speed, each sequence being carried out within 1 min.
et: Seda järjestust tuleb ühesuguse kiirusega korrata kolm korda, kusjuures iga tõstetsükli kestus on 1 min piirides.

source: After the test, with the test weights in place, the transport unit shall show no cracks or permanent distortions, visible to normal or corrected vision without additional magnification, that could impair any of its characteristics.
et: Pärast katsetust ei tohi kohale asetatud katsetusmassiga transportühikul olla normaalse või korrigeeritud nägemise korral suurenduseta nähtavaid mõrasid ega püsivaid kahjustusi, mis võivad halvendada kooste mingeid omadusi.

source: 10.2.5.2 Verification by comparison to a reference design Enclosures with the same or equal constructional design and arrangements for lifting are verified if having an equal or lower weight than that tested as the representative sample.
et: 10.2.5.2 Kontroll võrdlemise teel etalonkonstruktsiooniga Ühesuguse või samaväärse konstruktsioonilise kujundusega ümbrised ja tõstevahendite korraldus on kontrollitud, kui nende kaal on sama või väiksem kui esinduslikul näidisel katsetatud.

source: 10.2.6 Verification of protection against mechanical impact (IK code) Mechanical impact tests, where required by the specific assembly standard, are to be carried out in accordance with the test requirements of the specific assembly standard.
et: 10.2.6 Mehaaniliste löökide vastase kaitse (IK-koodi) kontroll Kui kooste eristandardid nõuavad katsetamist mehaaniliste löökide suhtes, tuleb need sooritada spetsiifilise koostestandardi katsetamisnõuete järgi.

source: 10.2.7 Marking
et: 10.2.7 Märgistamine

source: 10.2.7.1 Verification by test
et: 10.2.7.1 Kontroll katsetuse teel

source: Marking made by moulding, pressing, engraving or similar, including labels with a laminated plastic covering, shall not be submitted to the following test.
et: Valamise, pressimise, graveerimise või muu sarnase meetodiga tehtud märgistust, sealhulgas plastlaminaatkattega silte, ei ole vaja alljärgneval viisil katsetada.

source: The test is made by rubbing the marking by hand for 15 s with a piece of cloth soaked in water and then for 15 s with a piece of cloth soaked with petroleum spirit.
et: Katsetus tehakse märgistuse käsitsi hõõrumise teel 15 s kestel veega niisutatud riidetükiga ja seejärel 15 s kestel lakibensiiniga niisutatud riidetükiga.

source: NOTE The petroleum spirits n-hexane or heptane are suitable solvents for this test.
et: MÄRKUS Lakibensiinid, mis sobivad lahustitena selle katsetuse jaoks, on n-heksaan ja heptaan.

source: After the test, the marking shall be legible to normal or corrected vision without additional magnification.
et: Pärast katsetust peab märgistus olema normaalse või korrigeeritud nägemise korral suurenduseta selgelt loetav.

source: 10.2.7.2 Verification by comparison to a reference design Markings of a same material and method of printing are covered by the tests completed on the reference samples.
et: 10.2.7.2 Kontroll võrdlemise teel etalonkonstruktsiooniga Samast materjalist ja sama trükkimismeetodiga märgistused on kaetud komplektsete etalonnäidistega sooritatud katsetustega.

source: 10.2.8 Mechanical operation 10.2.8.1 Verification by test This verification test shall not be made on such devices of the assembly which have already been type tested according to their relevant product standard (e.g. withdrawable circuit-breaker) unless their mechanical operation has been modified by their mounting arrangements differing from those given in the device manufacturer’s instructions.
et: 10.2.8 Mehaaniline talitlus 10.2.8.1 Kontroll katsetuse teel Seda kontrollkatsetust ei pea sooritama kooste nendel seadistel (nt väljatõmmatavatel kaitselülititel), mis on juba läbinud tüübikatsetused oma asjakohase tootestandardi järgi, väljaarvatult juhtumeil, mil nende mehaaniline talitlus on võrreldes seadise tootja esitatud juhistega nende monteerimiskorraldusega muutunud.

source: For parts that need to be verified through testing (see 8.1.5), intended mechanical operation shall be verified after installation in the assembly.
et: Osade kohta, mis vajavad kontrolli katsetamise teel (vt jaotis 8.1.5), tuleb ette nähtud mehaanilist talitlust kontrollida pärast koostesse paigaldamist.

source: The number of operating cycles shall be 200.
et: Talitlustsüklite arv peab olema 200.

source: Where a device has been tested in accordance with its own product standard, but the mounting arrangement is not in accordance with the manufacturer’s instructions, the number of operations shall be in accordance with the product standard.
et: Kui seadist on katsetatud oma asjakohase tootestandardi järgi, kuid monteerimiskorraldus ei ole vastavuses tootja juhistega, peab tsüklite arv olema vastavuses tootestandardiga.

source: At the same time, the operation of the mechanical interlocks associated with these movements shall be checked.
et: Samal ajal tuleb kontrollida sellise liikumisega seotud mehaaniliste blokeeringute talitlust.

source: The test is passed if the operating conditions of the apparatus, interlocks, the specified degree of protection and position indication, if any, have not been impaired and if the effort required for operation is practically the same as before the test.
et: Katsetus on läbitud, kui aparaatide ja blokeeringute talitlusolud, sätestatud kaitseaste ja asendinäidustus, kui see on olemas, ei ole kahjustatud ja kui talitluseks nõutav jõutarve on praktiliselt sama mis enne katsetust.

source: For devices that have specific operational criteria the device product standard and/or the manufacturer’s instructions should be consulted.
et: Spetsiifiliste talitluskriteeriumidega seadiste puhul tuleb pöörduda seadise tootestandardi ja/või tootja juhiste poole.

source: 10.2.8.2 Verification by comparison to a reference design Enclosures with the same or equal constructional solution for mechanical operation are covered by tests completed on the reference samples.
et: 10.2.8.2 Kontroll võrdlemise teel etalonkonstruktsiooniga Ühesuguse või samaväärse konstruktsioonilise lahendusega ümbriste mehaaniline talitlus on kaetud etalonnäidistega sooritatud katsetustega.

source: 10.3 Degree of protection of assemblies (IP Code) The degree of protection provided in accordance with 8.2.2, 8.2.3 and 8.4.2.3 shall be verified in accordance with IEC 60529:1989, IEC 60529:1989/AMD1:1999 and IEC 60529:1989/AMD2:2013; the test may be carried out on one representative equipped assembly in a condition stated by the original manufacturer.
et: 10.3 Koostete kaitseaste (IP-kood) Kaitseastet, mis on ette nähtud vastavuses jaotistele 8.2.2, 8.2.3 ja 8.4.2.3, tuleb kontrollida standardite IEC 60529:1989, IEC 60529:1989/AMD1:1999 ja IEC 60529:1989/AMD2:2013 järgi; katsetuse võib sooritada ühe esindusliku, seadmetega varustatud koostega esmatootja sätestatud oludes.

source: Where an empty enclosure in accordance with IEC 62208:2011 or an assembly enclosure tested in accordance with the IEC 61439 series is used, a verification assessment shall be performed to ensure that any external modification that has been carried out does not result in a deterioration of the degree of protection.
et: Kui vastavalt standardile IEC 62208:2011 kasutatakse tühja ümbrist või kooste sellist ümbrist, mida on katsetatud standardisarja IEC 61439 kohaselt, tuleb sooritada kontrollhindamine veendumaks, et mis tahes rakendatud väline muudatus ei põhjusta kaitseastme vähenemist.

source: Such an assessment can, for example, be a visual check to confirm that a device with a suitable degree of protection (IP code) has been installed in an opening in an enclosure in accordance with the device manufacturer’s installation instructions.
et: Selline hindamine võib näiteks seisneda visuaalkontrollis, et kinnitada, kas sobiva kaitseastmega (IP-koodiga) seadis on paigaldatud ümbrise avasse vastavalt seadise tootja paigaldusjuhistele.

source: In this case, no further testing is required.
et: Sel juhul pole edasine katsetus vajalik.

source: Degree of protection (IP code) tests shall be carried out: – with all covers and doors in place and closed as in normal service, irrespective of whether they can be opened or removed, with or without the use of key or tool; – in a de-energized state (main and auxiliary circuits); – where the assembly is made up of multiple sections or is described as extendable, joined sections shall be included.
et: Kaitseastme (IP-koodi) katsetused tuleb sooritada — olukorras, mil kõik katted ja uksed on nagu normaaltalitlusel paigas ja suletud, sõltumata sellest, kas neid saab avada või eemaldada võtme või tööriista kasutamisega või ilma võtme või tööriista kasutamiseta; — nii pea- kui ka abiahelate pingestamata olekus; — juhul, mil kooste koosneb mitmest sektsioonist või on kirjeldatud kui laiendatav – koos ühendatud sektsioonidega.

source: Assemblies having a degree of protection of IP5X shall be tested according to category 2 in 13.4 of IEC 60529:1989 and IEC 60529:1989/AMD1:1999;
et: Koosteid, mille kaitseaste on IP5X, tuleb katsetada vastavalt standardite IEC 60529:1989 ja IEC 60529:1989/AMD1:1999 jaotise 13.4 kategooriale 2.

source: Assemblies having a degree of protection of IP6X shall be tested according to category 1 in 13.4 of IEC 60529:1989 and IEC 60529:1989/AMD1:1999;
et: Koosteid, mille kaitseaste on IP6X, tuleb katsetada vastavalt standardite IEC 60529:1989 ja IEC 60529:1989/AMD1:1999 jaotise 13.4 kategooriale 1.

source: NOTE The tests given in IEC 60529:1989, IEC 60529:1989/AMD1:1999 and IEC 60529:1989/AMD2:2013; related to water and dust are accelerated tests and do not represent actual operating conditions for the assembly.
et: MÄRKUS Katsetused, mis on esitatud standardites IEC 60529:1989, IEC 60529:1989/AMD1:1999 ja IEC 60529:1989/AMD2:2013 ning mis käivad vee ja tolmu kohta, on kiirkatsetused ega esinda kooste tegelikke talitlusolusid.

source: The test simulates the conditions for the assembly over its life in a short period of time.
et: Katsetus imiteerib kooste olusid selle kasutusea jooksul, kuid lühikese ajavahemiku korral.

source: In true life a slow pollution takes place which is removed by regular maintenance.
et: Tegeliku kasutusea jooksul on tegemist aeglase saastumisega, mida saab kõrvaldada regulaarse hooldusega.

source: The test device for IPX3 and IPX4 as well as the type of support for the enclosure during the IPX4 test shall be stated in the test report.
et: Katsetusseadis kaitseastmete IPX3 ja IPX4 katsetamisel, nagu ka ümbrise toestuse viis kaitseastme IPX4 katsetamisel, peavad olema esitatud katsetusaruandes.

source: The IPX1 test may be carried out by moving the drip box instead of rotating the assembly.
et: Kaitseastme IPX1 katsetuse võib kooste pööramise asemel teha ka tilgutuskasti liigutamisega.

source: If the dimensions of the surface of the assembly to be tested are larger than the dimensions of the drip box, the test shall be repeated as often as necessary to cover all relevant surfaces of the assembly.
et: Kui kooste katsetatava pinna mõõtmed on suuremad kui tilgutuskasti omad, tuleb katsetust korrata nii sageli kui vaja, et kooste kõik asjakohased pinnad oleksid hõlmatud.

source: Each separate test shall take 10 min.
et: Iga eri katsetus peab kestma 10 minutit.

source: Ingress of water in the IPX1 to IPX6 tests on an assembly is permissible only if its route of entry is obvious and the water is only in contact with the enclosure at a location where it will not reduce the clearance and creepage distances.
et: Vee sissepääs kooste katsetamisel kaitseastmete IPX1 kuni IPX6 puhul on lubatud vaid juhul, kui vee sissepääsukoht on selgelt näha ja kui vesi puutub ümbrisega kokku vaid kohtades, kus see ei vähenda õhk- ega roomevahemikke.

source: If clearances and creepage distances are reduced, they shall not be below the minimum specified in Table 1 and Table 2, respectively.
et: Kui õhk- ja roomevahemikke on kitsendatud, ei tohi need olla alla tabelites 1 ja 2 sätestatud vähimväärtuste.

source: The IP5X test is deemed to be a failure if dust is visible on creepage paths housed within the enclosure and creepage distances are reduced below the minimum specified in Table 2, see IEC 60529:1989, 13.5.2.
et: Kaitseastme IP5X katsetus arvestatakse ebaõnnestunuks, kui tolmu on silmaga nähtavalt ümbrise sees olevatel roomeradadel ja roomevahemikke on kitsendatud alla tabelis 2 sätestatud vähimväärtuste; vt standardi IEC 60529:1989 jaotis 13.5.2.

source: 10.4 Clearances and creepage distances It shall be verified that the clearances and creepage distances comply with the requirements of 8.3.
et: 10.4 Õhk- ja roomevahemikud Tuleb kontrollida, kas õhk- ja roomevahemikud vastavad jaotise 8.3 nõuetele.

source: The creepage distances shall be measured in accordance with Annex F.
et: Roomevahemikke tuleb mõõta vastavalt lisale F.

source: Clearances are verified by measurement according to Annex F or by test according to 10.9.3.
et: Õhkvahemikke tuleb kontrollida mõõtmise teel vastavalt lisale F või katsetuse teel jaotise 10.9.3 kohaselt.

source: 10.5 Protection against electric shock and integrity of protective circuits
et: 10.5 Kaitse elektrilöögi eest ja kaitseahelate terviklikkus

source: 10.5.1 General
et: 10.5.1 Üldnõuded

source: The effectiveness of the earth continuity and the protective circuit is verified for the following functions:
et: Maanduse pidevuse ja kaitseahela tõhusust kontrollitakse järgmiste funktsioonide alusel:

source: 1) protection against the consequences of a fault within the class I assembly (internal faults) as outlined in 10.5.2; and
et: 1) kaitse I klassi kooste rikke (sisemiste rikete) tagajärgede eest, nagu see on kirjeldatud jaotises 10.5.2, ja

source: 2) protection against the consequences of faults in external circuits supplied through the assembly (external faults) as outlined in 10.5.3.
et: 2) kaitse koostet läbivate väliste ahelate rikete (väliste rikete) tagajärgede eest, nagu see on kirjeldatud jaotises 10.5.3.
